Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/pensions/the_pensions_board.html.txt.tmx
Source language: en
Languages: ga

source: The Pensions Authority (formerly known as the Pensions Board) provides for the proper administration of pension schemes and the protection of pension rights for people living in Ireland
ga: Forálann an tÚdarás Pinsean do riar ceart scéimeanna pinsean agus do chosaint chearta pinsin do dhaoine atá ina gcónaí in Éirinn

source: The Authority is the regulatory body for occupational pension schemes and Personal Retirement Savings Accounts (PRSAs) and also has a role in the development of pension policy in general
ga: Is é an tÚdarás an comhlacht rialála ar scéimeanna pinsean ceirde agus Cuntais Choigiltis Scoir Pearsanta (CCSPanna) agus tá ról aige i bhforbairt beartais pinsean go ginearálta

source: Under the Social Welfare and Pensions (Miscellaneous Provisions) Act 2013 the Pensions Board was renamed the Pensions Authority and its Chief Executive become the Pensions Regulator
ga: Ba faoin Acht Leasa Shóisialaigh agus Pinsean (Forálacha Ilghnéitheacha) 2013 a athainmníodh an Bord Pinsean mar an tÚdarás Pinsean, agus d’éirigh a Phríomhfheidhmeannach ina Rialtóir Pinsean

source: These changes took effect from 7 March 2014
ga: Tháinig na hathruithe sin i bhfeidhm ó 7 Márta 2014

source: Oversight of the Pensions Authority will be provided by a three-person board
ga: Is é bord le triúr daoine air a sholáthróidh maoirsiú don Údarás Pinsean

source: The Pensions Regulator will continue to perform the Chief Executive functions of the Pensions Authority
ga: Leanfaidh an tÚdarás Pinsean ar aghaidh ag feidhmiú fheidhmeanna Príomhfheidhmeannaigh an Údaráis Phinsean

source: A separate Pensions Council was set up to advise the Minister for Social Protection on matters relating to policy on pensions and protect the consumer interest
ga: Bunaíodh Comhairle Pinsean ar leithligh chun comhairle a thabhairt don Aire Coimirce Sóisialaí i leith cúrsaí a bhaineann le beartas um pinsin agus chun leas na dtomhaltóirí a chosaint

source: What does the Pensions Authority have responsibility for?
ga: Céard as a bhfuil an tÚdarás Pinsean freagrach?

source: The Authority has responsibility for:
ga: Tá an tÚdarás freagrach as:

source: • Promoting the security and protection of members of occupational pension schemes and contributors to Personal Retirement Savings Accounts
ga: • Slándáil agus cosaint bhaill de scéimeanna pinsean ceirde agus ranníocóirí le Cuntais Choigiltis Scoir Pearsanta a chur chun cinn

source: • Promoting the development of efficient national pension structures
ga: • Forbairt struchtúir pinsean náisiúnta éifeachtacha a chur chun cinn

source: • Encouraging people to take part in a pension scheme to ensure that they have adequate retirement income, and
ga: • Daoine a spreagadh chun páirt a ghlacadh i scéim pinsean lena chinntiú go bhfuil go leor ioncaim scoir acu, agus

source: • Providing information and authoritative guidance to relevant parties about pension security, structures, etc
ga: • Eolas agus treoir údarásach a sholáthar do pháirtithe ábhartha faoi shlándáil pinsean, struchtúir pinsean, srl

source: What does the Pensions Authority do on a day-to-day basis?
ga: Céard a dhéanann an tÚdarás Pinsean ó lá go lá?

source: • The Pensions Authority provides information to both members and trustees of pension schemes
ga: • Cuireann an tÚdarás Pinsean eolas ar fáil do bhaill agus iontaobhaithe scéimeanna pinsean

source: • It monitors the Defined Benefit Occupational Pension Schemes compliance with the Pension Act 1990 and its amendments
ga: • Déanann sé monatóireacht ar ghéilliúlacht na Scéimeanna Pinsean Ceirde Sochair Shainithe le hAcht na bPinsean 1990 agus a chuid leasuithe

source: • It has a number of responsibilities with regard to PRSAs, for example, to approve PRSA products with the Revenue Commissioners and to keep a public register of PRSA Providers and products
ga: • Tá roinnt freagrachtaí aige maidir le CCSPanna, mar shampla, táirgí CCSP a fhaomhadh leis na Coimisinéirí Ioncaim agus clár poiblí a choimeád de sholáthraithe agus tháirgí CCSP

source: • Monitors and supervises the operation of the Pensions Act and pension developments generally
ga: • Déanann sé monatóireacht agus maoirseacht ar fheidhmiú Acht na bPinsean agus fhorbairtí pinsean go ginearálta

source: • Issues guidelines on the duties and responsibilities of the trustees (who hold and look after pension funds) of occupational pension schemes and codes of practice on specific aspects of their responsibilities
ga: • Eisíonn sé treoirlínte ar dhualgais agus fhreagrachtaí iontaobhaithe (a choimeádann cistí pinsean agus atá i bhfeighil orthu) scéimeanna pinsean ceirde agus cóid chleachtais ar ghnéithe ar leith dá gcuid freagrachtaí

source: • Advises the Minister for Social Protection on the operation of the Pensions Act and on pension matters generally
ga: • Cuireann sé comhairle ar an Aire Coimirce Sóisialaíar fheidhmiú Acht na bPinsean agus ar chúrsaí pinsean go ginearálta

source: The Pensions Authority provides information services to help members of pension schemes understand their rights and to use these rights to ensure that their pensions are fully protected
ga: Soláthraíonn an tÚdarás seirbhísí eolais le cabhrú le baill de scéimeanna pinsean a gcearta a thuiscint agus leas a bhaint as na cearta sin lena chinntiú go bhfuil a bpinsin faoi chosaint iomlán

source: The Authority also provides information for trustees and pension providers
ga: Cuireann an tÚdarás eolas ar fáil d'iontaobhaithe agus sholáthraithe pinsean chomh maith

source: A range of booklets about pensions are available free of charge from the Authority which you may download
ga: Tá raon de leabhráin faoi phinsin le fáil saor in aisce ón Údarás ar féidir leat a íoslódáil

source: You can also request printed copies of these booklets from the Authority directly
ga: Is féidir leat cóipeanna i gcló de na leabhráin seo a iarraidh díreach ón Údarás chomh maith

source: An information and enquiry service is provided to answer questions related to occupational pension schemes and PRSAs
ga: Cuirtear seirbhís eolais agus fiosraithe ar fáil chun ceisteanna a fhreagairt maidir le scéimeanna pinsean ceirde agus CCSPanna

source: See below for contact details
ga: Féach thíos le sonraí teagmhála a fháil

source: Making a complaint about a pension provider or scheme
ga: Gearán a dhéanamh faoi sholáthraí pinsean nó scéim pinsean

source: The Pensions Authority can assist you if you are concerned about the operation of your PRSA or occupational pension scheme
ga: Is féidir leis an Údarás Pinsean cabhrú leat má tá imní ort faoi fheidhmiú do CCSP nó do scéime pinsean ceirde

source: If you have a complaint about your pension that you are unable to resolve with your PRSA provider (or, in the case of occupational pensions with your employer, pension administrator or trustees), then you may contact the Pensions Authority for advice and assistance
ga: Má tá gearán agat faoi do phinsean nach bhfuil tú in ann a réiteach le do sholáthraí CCSP (nó, i gcás pinsin cheirde le d'fhostóir, riarthóir pinsean nó iontaobhaithe), ansin is féidir leat dul i dteagmháil leis an Údarás Pinsean le comhairle agus cúnamh a fháil

source: The Pensions Authority can:
ga: Is féidir leis an Údarás:

source: • Act on behalf of pension scheme members who are concerned about their schemes
ga: • Gníomhú ar son baill scéime pinsean atá buartha faoina scéimeanna

source: • Investigate the status and conduct of an occupational pension scheme
ga: • Fiosrú a dhéanamh ar stádas agus stiúradh scéim pinsean ceirde

source: • Prosecute for breaches of the Pensions Acts
ga: • Ionchúiseamh a dhéanamh de bharr sháruithe ar Achtanna na bPinsean

source: • Take court action against trustees for the protection of members and their rights
ga: • Caingean chúirte a ghlacadh in aghaidh iontaobhaithe chun baill agus a gcearta a chosaint

source: Get more information on complaints about pensions
ga: Cliceáil anseo le tuilleadh eolais a fháil ar ghearáin faoi phinsin

source: The Pensions Authority also provides information for trustees and pension providers
ga: Cuireann an tÚdarás eolas ar fáil d'iontaobhaithe agus sholáthraithe pinsean chomh maith
